package com.ccj.poptabview;

/**
 * Update by chenchangjun on 17/4/6.
 */
public class FilterConfig {

    //popwindow类型
    public  final  static int TYPE_POPWINDOW_SINGLE=0;//单选pop
    public  final  static int TYPE_POPWINDOW_LINKED=1;//二级pop
    public  final  static int TYPE_POPWINDOW_SORT=2;//筛选pop


    //旅游全部筛选位置顺序
    public static final int LVYOU_FILTER_POSITION_FROME = 0;
    public static final int LVYOU_FILTER_POSITION_TO = 1;
    public static final int LVYOU_FILTER_POSITION_TYPE = 2;
    public static final int LVYOU_FILTER_POSITION_FILTER = 3;

    //旅游 出行必备 位置顺序
    public static final int LVYOU_FILTER_POSITION_TRAVEL_TYPE = 4;
    public static final int LVYOU_FILTER_POSITION_TRAVEL_COUNTRY = 5;



    //通用筛选 单选,多选 判断
    public static final int FILTER_TYPE_SINGLE =1 ;
    public static final int FILTER_TYPE_MUTIFY = 2;


    /**
     * 测试json
     */
    public static String sortTestJson="{\n" +
            "    \"error_code\": \"0\",\n" +
            "    \"error_msg\": \"\",\n" +
            "    \"smzdm_id\": \"0\",\n" +
            "    \"s\": \"59522789c2a64966482\",\n" +
            "    \"data\": {\n" +
            "        \"channel\": {\n" +
            "            \"home\": \"1776831\",\n" +
            "            \"youhui\": \"279835\",\n" +
            "            \"faxian\": \"1478155\",\n" +
            "            \"haitao\": \"139745\",\n" +
            "            \"news\": \"14194\",\n" +
            "            \"yuanchuang\": \"101413\",\n" +
            "            \"zhongce\": \"20575\",\n" +
            "            \"haowu\": \"765\",\n" +
            "            \"wiki\": \"90884\",\n" +
            "            \"second_hand\": \"51070\",\n" +
            "            \"faxian_jingxuan\": \"212970\",\n" +
            "            \"zhongce_product\": \"1447\",\n" +
            "            \"pingce\": \"19128\"\n" +
            "        },\n" +
            "        \"category\": [\n" +
            "            {\n" +
            "                \"id\": \"163\",\n" +
            "                \"name\": \"电脑数码\",\n" +
            "                \"count\": \"273756\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"95\",\n" +
            "                \"name\": \"食品保健\",\n" +
            "                \"count\": \"213218\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"57\",\n" +
            "                \"name\": \"服饰鞋包\",\n" +
            "                \"count\": \"210845\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"27\",\n" +
            "                \"name\": \"家用电器\",\n" +
            "                \"count\": \"187768\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"113\",\n" +
            "                \"name\": \"个护化妆\",\n" +
            "                \"count\": \"180501\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"1515\",\n" +
            "                \"name\": \"日用百货\",\n" +
            "                \"count\": \"167345\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"191\",\n" +
            "                \"name\": \"运动户外\",\n" +
            "                \"count\": \"135785\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"75\",\n" +
            "                \"name\": \"母婴用品\",\n" +
            "                \"count\": \"132854\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"37\",\n" +
            "                \"name\": \"家居家装\",\n" +
            "                \"count\": \"82516\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"131\",\n" +
            "                \"name\": \"礼品钟表\",\n" +
            "                \"count\": \"57897\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"93\",\n" +
            "                \"name\": \"玩模乐器\",\n" +
            "                \"count\": \"46164\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"147\",\n" +
            "                \"name\": \"汽车消费\",\n" +
            "                \"count\": \"41495\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"7\",\n" +
            "                \"name\": \"图书音像\",\n" +
            "                \"count\": \"41329\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"177\",\n" +
            "                \"name\": \"办公设备\",\n" +
            "                \"count\": \"35852\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"5337\",\n" +
            "                \"name\": \"旅游出行\",\n" +
            "                \"count\": \"28242\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"1523\",\n" +
            "                \"name\": \"金融服务\",\n" +
            "                \"count\": \"20981\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"5375\",\n" +
            "                \"name\": \"文化娱乐\",\n" +
            "                \"count\": \"11218\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"id\": \"5384\",\n" +
            "                \"name\": \"房产置业\",\n" +
            "                \"count\": \"9522\"\n" +
            "            }\n" +
            "        ],\n" +
            "        \"mall\": {\n" +
            "            \"guonei\": [\n" +
            "                {\n" +
            "                    \"id\": \"183\",\n" +
            "                    \"name\": \"京东\",\n" +
            "                    \"count\": \"468939\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"247\",\n" +
            "                    \"name\": \"天猫精选\",\n" +
            "                    \"count\": \"245437\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"269\",\n" +
            "                    \"name\": \"亚马逊中国\",\n" +
            "                    \"count\": \"153802\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"239\",\n" +
            "                    \"name\": \"苏宁易购\",\n" +
            "                    \"count\": \"77733\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"43\",\n" +
            "                    \"name\": \"1号店\",\n" +
            "                    \"count\": \"36285\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"153\",\n" +
            "                    \"name\": \"当当\",\n" +
            "                    \"count\": \"22651\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"167\",\n" +
            "                    \"name\": \"国美在线\",\n" +
            "                    \"count\": \"18828\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"241\",\n" +
            "                    \"name\": \"聚划算\",\n" +
            "                    \"count\": \"17014\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"243\",\n" +
            "                    \"name\": \"淘宝精选\",\n" +
            "                    \"count\": \"14141\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"2537\",\n" +
            "                    \"name\": \"天猫超市\",\n" +
            "                    \"count\": \"7592\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"265\",\n" +
            "                    \"name\": \"新蛋中国\",\n" +
            "                    \"count\": \"7142\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"261\",\n" +
            "                    \"name\": \"中粮我买网\",\n" +
            "                    \"count\": \"6785\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"2971\",\n" +
            "                    \"name\": \"飞猪\",\n" +
            "                    \"count\": \"6714\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"281\",\n" +
            "                    \"name\": \"优购网\",\n" +
            "                    \"count\": \"5674\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"237\",\n" +
            "                    \"name\": \"顺丰优选\",\n" +
            "                    \"count\": \"3836\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"haiwai\": [\n" +
            "                {\n" +
            "                    \"id\": \"41\",\n" +
            "                    \"name\": \"美国亚马逊\",\n" +
            "                    \"count\": \"115168\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"271\",\n" +
            "                    \"name\": \"日本亚马逊\",\n" +
            "                    \"count\": \"36864\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"49\",\n" +
            "                    \"name\": \"6PM\",\n" +
            "                    \"count\": \"27133\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"51\",\n" +
            "                    \"name\": \"Ashford\",\n" +
            "                    \"count\": \"10796\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"73\",\n" +
            "                    \"name\": \"ebay\",\n" +
            "                    \"count\": \"10191\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"155\",\n" +
            "                    \"name\": \"德国亚马逊\",\n" +
            "                    \"count\": \"7710\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"279\",\n" +
            "                    \"name\": \"英国亚马逊\",\n" +
            "                    \"count\": \"7046\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"751\",\n" +
            "                    \"name\": \"STP\",\n" +
            "                    \"count\": \"5594\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"97\",\n" +
            "                    \"name\": \"JOMASHOP\",\n" +
            "                    \"count\": \"4680\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"759\",\n" +
            "                    \"name\": \"莎莎网\",\n" +
            "                    \"count\": \"4479\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"2733\",\n" +
            "                    \"name\": \"法国亚马逊\",\n" +
            "                    \"count\": \"2761\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"133\",\n" +
            "                    \"name\": \"woot\",\n" +
            "                    \"count\": \"2436\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"2937\",\n" +
            "                    \"name\": \"bodyguard apotheke中文官网\",\n" +
            "                    \"count\": \"2351\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"131\",\n" +
            "                    \"name\": \"wiggle中文官网\",\n" +
            "                    \"count\": \"2266\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"95\",\n" +
            "                    \"name\": \"Joe's NB Outlet\",\n" +
            "                    \"count\": \"2174\"\n" +
            "                }\n" +
            "            ],\n" +
            "            \"kuajing\": [\n" +
            "                {\n" +
            "                    \"id\": \"4033\",\n" +
            "                    \"name\": \"亚马逊海外购\",\n" +
            "                    \"count\": \"28366\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"3949\",\n" +
            "                    \"name\": \"京东全球购\",\n" +
            "                    \"count\": \"21923\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"3981\",\n" +
            "                    \"name\": \"网易考拉海购\",\n" +
            "                    \"count\": \"19763\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"3613\",\n" +
            "                    \"name\": \"西集网\",\n" +
            "                    \"count\": \"15691\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"2897\",\n" +
            "                    \"name\": \"天猫国际\",\n" +
            "                    \"count\": \"6474\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"2233\",\n" +
            "                    \"name\": \"云猴全球购\",\n" +
            "                    \"count\": \"5888\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"3467\",\n" +
            "                    \"name\": \"丰趣海淘\",\n" +
            "                    \"count\": \"4588\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"345\",\n" +
            "                    \"name\": \"百悦网\",\n" +
            "                    \"count\": \"2800\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"5395\",\n" +
            "                    \"name\": \"宝贝格子\",\n" +
            "                    \"count\": \"2556\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"4683\",\n" +
            "                    \"name\": \"国美海外购\",\n" +
            "                    \"count\": \"2372\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"4031\",\n" +
            "                    \"name\": \"苏宁易购海外购\",\n" +
            "                    \"count\": \"2184\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"4373\",\n" +
            "                    \"name\": \"达令网\",\n" +
            "                    \"count\": \"2054\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"4273\",\n" +
            "                    \"name\": \"海豚村\",\n" +
            "                    \"count\": \"1823\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"5644\",\n" +
            "                    \"name\": \"奥买家全球购\",\n" +
            "                    \"count\": \"1788\"\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": \"4261\",\n" +
            "                    \"name\": \"跨境网\",\n" +
            "                    \"count\": \"1149\"\n" +
            "                }\n" +
            "            ]\n" +
            "        }\n" +
            "    }\n" +
            "}";


}






